## ***Filtering***

In [1]:
import numpy as np
import pandas as pd

data=pd.read_csv(r'C:\Users\MITHUNKUMAR S\Desktop\Jupyter\train.csv')

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

***Below are the two methods using which we can filter the dataframe***

In [80]:
data[data.Sex=="male"].shape

(577, 12)

In [7]:
data[data["Sex"]=="female"].shape

(314, 12)

***TO find the count of the number of males and females survived***

In [11]:
data[(data.Sex=="male") & (data.Survived==1)].shape

(109, 12)

In [12]:
data[(data.Sex=="female") & (data.Survived==1)].shape

(233, 12)

***Number of males Survived:***

In [14]:
109/577

0.18890814558058924

***Number of females Survived:***

In [15]:
233/314

0.7420382165605095

***The above can also be done as***

In [78]:
c1=data.Sex=='male'
c2=data.Survived==1
data[c1 & c2].shape

(109, 12)

In [35]:
males=data[data.Sex=="male"]
c3=males[males.Survived==1]
c3.shape

(109, 12)

***To Filter only particular columns we make use of loc***

In [52]:
data.loc[data.Sex=="male",["Name"]].head(4)

                       Name
0   Braund, Mr. Owen Harris
4  Allen, Mr. William Henry
5          Moran, Mr. James
6   McCarthy, Mr. Timothy J

In [53]:
data.loc[(data.Sex=="male")&(data.Survived==1),["PassengerId","Name","Age"]].head(3)

    PassengerId                          Name   Age
17           18  Williams, Mr. Charles Eugene   NaN
21           22         Beesley, Mr. Lawrence  34.0
23           24  Sloper, Mr. William Thompson  28.0